In [1]:
import pandas as pd
import geopandas as gpd

from shapely.geometry import Point
from sqlalchemy import create_engine

# Ubicación del archivo .csv que se desea cargar
TRIPS_FILE = './trips.csv'

# Not safe!! Está OK para efectos de este ejercicio, pero normalmente guardaríamos las conexiones y credenciales
# en algún almacenamiento seguro.
SQL_ENGINE = create_engine('postgresql://postgres:4WT0_TEST#!!@localhost:5432/postgres')

## Paso 1: Cargar archivo .csv a dataframe

In [2]:
# Cargar csv
trips_df = pd.read_csv(TRIPS_FILE, parse_dates=['booking_time','start_time','end_time'])

# Corroborar dtypes
print(trips_df.info())

# Inspeccionar dataframe
trips_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 18 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   trip_id        10000 non-null  int64
 1   user_id        10000 non-null  int64
 2   name_user      10000 non-null  object
 3   rut_user       10000 non-null  int64
 4   vehicle_id     10000 non-null  int64
 5   booking_time   10000 non-null  datetime64[ns]
 6   start_time     10000 non-null  datetime64[ns]
 7   end_time       10000 non-null  datetime64[ns]
 8   status_id      10000 non-null  int64
 9   travel_dist    10000 non-null  int64
 10  membership_id  10000 non-null  int64
 11  price_amount   10000 non-null  int64
 12  price_tax      10000 non-null  float64
 13  price_total    10000 non-null  int64
 14  start_lat      10000 non-null  float64
 15  start_lon      10000 non-null  float64
 16  end_lat        10000 non-null  float64
 17  end_lon        10000 non-null  float64
dtypes: datetime64[ns](3), float64(5), int64(9), object(1)
memory usage: 1.4+ MB
None

,trip_id,user_id,name_user,rut_user,vehicle_id,booking_time,start_time,end_time,status_id,travel_dist,membership_id,price_amount,price_tax,price_total,start_lat,start_lon,end_lat,end_lon
0,0,476,Rebecca Charles,59959528,95,2022-03-07 22:48:16,2022-03-07 22:55:16,2022-03-08 18:28:16,4,6165688,1,11122,2113.18,13235,-33.878638,-71.027883,-34.123515,-71.356369
1,1,427,Alex Reeves,90517421,83,2022-07-08 19:36:54,2022-07-08 19:43:54,2022-07-09 09:52:54,3,7020217,1,2489,472.91,2961,-34.098971,-71.275367,-33.856470,-71.170419
2,2,987,Mr. Jeremy Torres,36729496,61,2022-05-25 05:04:42,2022-05-25 05:14:42,2022-05-25 08:16:42,3,803100,3,1656,314.64,1970,-33.581529,-70.538966,-33.930672,-70.507020
3,3,343,Amanda Willis,70770856,12,2022-05-12 03:53:27,2022-05-12 04:02:27,2022-05-12 04:40:27,1,24,3,28272,5371.68,33643,-34.341512,-71.411191,-34.029063,-71.222540
4,4,74,Brenda Carter,23148564,92,2022-10-18 02:42:03,2022-10-18 02:55:03,2022-10-19 00:57:03,4,1049859,3,2765,525.35,3290,-33.510118,-70.545884,-33.843074,-70.567037

## Paso 2: Limpieza de datos

In [3]:
# Borrar viajes duplicados
filtered_df = trips_df.drop_duplicates(subset=['trip_id'])

# Borrar viajes con IDs nulos para respetar PKs en la BD
# Aquí estamos asumiendo que lo correcto es borrar viajes que contengan IDs nulos
not_null_cols = ['trip_id','user_id','name_user','rut_user','vehicle_id','booking_time','status_id','membership_id']
filtered_df = filtered_df.dropna(subset=not_null_cols)

## Paso 3: Insertar usuarios en dim_users

In [4]:
# Crear dataframe que contenga sólo los user_id únicos que se desea insertar
users_df = filtered_df[['user_id','name_user','rut_user']].drop_duplicates(subset=['user_id'])

# Inspeccionar resultado
users_df.head()

   user_id          name_user  rut_user
0      476    Rebecca Charles  59959528
1      427        Alex Reeves  90517421
2      987  Mr. Jeremy Torres  36729496
3      343      Amanda Willis  70770856
4       74      Brenda Carter  23148564

In [5]:
# Query que se utilizará para hacer UPSERT de usuarios
upsert_query = '''INSERT INTO dim_users 
SELECT * from users_tmp
ON CONFLICT ON CONSTRAINT dim_users_pk DO UPDATE SET
name_user = EXCLUDED.name_user, rut_user = EXCLUDED.rut_user
'''

# Insertar usuarios en tabla dim_users mediante UPSERT
with SQL_ENGINE.connect() as conn:
    # Primero insertar users_df en una tabla temporal
    users_df.to_sql('users_tmp', con=conn, schema='public', if_exists='replace', index=False)
    
    # Luego ejecutar query upsert
    conn.exec_driver_sql(upsert_query)
    
    # Borrar tabla temporal
    conn.exec_driver_sql("DROP TABLE users_tmp")
    
    conn.commit()

### Paso 4: Insertar viajes

In [6]:
# Filtrar sólo columnas necesarias
fact_table_cols = [
    'trip_id', 'status_id', 'user_id',
    'membership_id', 'vehicle_id', 'booking_time',
    'start_time', 'end_time', 'travel_dist',
    'price_amount', 'price_tax', 'price_total',
    'start_lat', 'start_lon', 'end_lat', 'end_lon'
]
fact_df = filtered_df[fact_table_cols]


# Crear columnas date_id y time_id
fact_df['booking_date_id'] = fact_df['booking_time'].dt.strftime('%Y%m%d')
fact_df['booking_time_id'] = fact_df['booking_time'].dt.strftime('%H%M%S')

fact_df['start_date_id'] = fact_df['start_time'].dt.strftime('%Y%m%d')
fact_df['start_time_id'] = fact_df['start_time'].dt.strftime('%H%M%S')

fact_df['end_date_id'] = fact_df['end_time'].dt.strftime('%Y%m%d')
fact_df['end_time_id'] = fact_df['end_time'].dt.strftime('%H%M%S')


# Eliminar columnas de datetime
fact_df.drop(['booking_time','start_time','end_time'], axis='columns', inplace=True)

# Inspeccionar
fact_df.head()

/tmp/ipykernel_17467/1247970917.py:13: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  fact_df['booking_date_id'] = fact_df['booking_time'].dt.strftime('%Y%m%d')

,trip_id,status_id,user_id,membership_id,vehicle_id,travel_dist,price_amount,price_tax,price_total,start_lat,start_lon,end_lat,end_lon,booking_date_id,booking_time_id,start_date_id,start_time_id,end_date_id,end_time_id
0,0,4,476,1,95,6165688,11122,2113.18,13235,-33.878638,-71.027883,-34.123515,-71.356369,20220307,224816,20220307,225516,20220308,182816
1,1,3,427,1,83,7020217,2489,472.91,2961,-34.098971,-71.275367,-33.856470,-71.170419,20220708,193654,20220708,194354,20220709,095254
2,2,3,987,3,61,803100,1656,314.64,1970,-33.581529,-70.538966,-33.930672,-70.507020,20220525,050442,20220525,051442,20220525,081642
3,3,1,343,3,12,24,28272,5371.68,33643,-34.341512,-71.411191,-34.029063,-71.222540,20220512,035327,20220512,040227,20220512,044027
4,4,4,74,3,92,1049859,2765,525.35,3290,-33.510118,-70.545884,-33.843074,-70.567037,20221018,024203,20221018,025503,20221019,005703

In [7]:
# Agrupar coordenadas en objeto PONT()
fact_df['start_coordinates'] = [
    Point(lon, lat) for lon, lat in fact_df[['start_lon','start_lat']].values
]
fact_df['end_coordinates'] = [
    Point(lon, lat) for lon, lat in fact_df[['end_lon','end_lat']].values
]

# Eliminar columnas de coordenadas individuales
fact_df.drop(['start_lon','start_lat','end_lon','end_lat'], axis='columns', inplace=True)

# Inspeccionar
fact_df.head()

,trip_id,status_id,user_id,membership_id,vehicle_id,travel_dist,price_amount,price_tax,price_total,booking_date_id,booking_time_id,start_date_id,start_time_id,end_date_id,end_time_id,start_coordinates,end_coordinates
0,0,4,476,1,95,6165688,11122,2113.18,13235,20220307,224816,20220307,225516,20220308,182816,POINT (-71.02788287609009 -33.87863782553843),POINT (-71.35636867720585 -34.12351529124292)
1,1,3,427,1,83,7020217,2489,472.91,2961,20220708,193654,20220708,194354,20220709,095254,POINT (-71.27536674906213 -34.09897118175137),POINT (-71.17041946443049 -33.85646972145668)
2,2,3,987,3,61,803100,1656,314.64,1970,20220525,050442,20220525,051442,20220525,081642,POINT (-70.53896558274045 -33.58152939751057),POINT (-70.5070203176805 -33.93067229606032)
3,3,1,343,3,12,24,28272,5371.68,33643,20220512,035327,20220512,040227,20220512,044027,POINT (-71.41119096154348 -34.34151202792005),POINT (-71.22253987691592 -34.02906300572435)
4,4,4,74,3,92,1049859,2765,525.35,3290,20221018,024203,20221018,025503,20221019,005703,POINT (-70.5458842471245 -33.51011760852834),POINT (-70.56703736236094 -33.84307445226951)

In [8]:
# Crear geodataframe y fijar sitema cordenado
gdf = gpd.GeoDataFrame(fact_df, crs="EPSG:4326", geometry='start_coordinates')
gdf = gdf.set_geometry('end_coordinates', crs="EPSG:4326")

# Inspeccionar resultado
gdf.info()

<class 'geopandas.geodataframe.GeoDataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   trip_id            10000 non-null  int64
 1   status_id          10000 non-null  int64
 2   user_id            10000 non-null  int64
 3   membership_id      10000 non-null  int64
 4   vehicle_id         10000 non-null  int64
 5   travel_dist        10000 non-null  int64
 6   price_amount       10000 non-null  int64
 7   price_tax          10000 non-null  float64
 8   price_total        10000 non-null  int64
 9   booking_date_id    10000 non-null  object
 10  booking_time_id    10000 non-null  object
 11  start_date_id      10000 non-null  object
 12  start_time_id      10000 non-null  object
 13  end_date_id        10000 non-null  object
 14  end_time_id        10000 non-null  object
 15  start_coordinates  10000 non-null  geometry
 16  end_coordinates    10000 non-null  geometry
dtypes: float64(1), geometry(2), int64(8), object(6)
memory usage: 1.3+ MB

In [9]:
# Insertar a tabla fact_trips
gdf.to_postgis('fact_trips', con=SQL_ENGINE, schema='public', if_exists='append')